spec/support/vcr_cassettes/mpi/update_profile/update_profile_server_error.yml

---
http_interactions:
- request:
    method: post
    uri: "<MPI_URL>"
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
          xmlns:xsd="http://www.w3.org/2001/XMLSchema"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          <soap:Body>
            <idm:PRPA_IN201302UV02 xmlns:idm="http://vaww.oed.oit.va.gov"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema‐instance" xsi:schemaLocation="urn:hl7‐org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201302UV02.xsd"
              xmlns="urn:hl7‐org:v3" ITSVersion="XML_1.0">
              <id extension="200VGOV-a632f12b-5330-4b02-9cef-6d2633f7b501" root="22a0f9e0-4454-11dc-a6be-3603d6866807"/>
              <creationTime value="20220805211942"/>
              <versionCode code="4.1"/>
              <interactionId extension="PRPA_IN201302UV02" root="2.16.840.1.113883.1.6"/>
              <processingCode code="T"/>
              <processingModeCode code="T"/>
              <acceptAckCode code="AL"/>
              <receiver typeCode="RCV">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id root="2.16.840.1.113883.4.349"/>
                </device>
              </receiver>
              <sender typeCode="SND">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
                </device>
              </sender>
              <controlActProcess classCode="CACT" moodCode="EVN">
                <subject typeCode="SUBJ">
                  <registrationEvent classCode="REG" moodCode="EVN">
                    <id nullFlavor="NA"/>
                    <statusCode code="active"/>
                    <subject1 typeCode="SBJ">
                      <patient classCode="PAT">
                        <id extension="1013677101V363970^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/>
                        <statusCode code="active"/>
                        <patientPerson>
                          <name use="L">
                            <given>abraham</given>
                            <family>lincoln</family>
                          </name>
                          <birthTime value="18090212"/>
                          <id extension="384759483^NI^200DOD^USDOD^A" root="2.16.840.1.113883.3.42.10001.100001.12"/>
                          <asOtherIDs classCode="SSN">
                            <id extension="796111863" root="2.16.840.1.113883.4.1"/>
                            <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                              <id root="2.16.840.1.113883.4.1"/>
                            </scopingOrganization>
                          </asOtherIDs>
                          <asOtherIDs classCode="PAT">
                            <id extension="384759483^NI^200DOD^USDOD^A" root="2.16.840.1.113883.3.42.10001.100001.12"/>
                            <scopingOrganization classCode="ORG" determinerCode="INSTANCE">
                              <id root="2.16.840.1.113883.4.349" />
                            </scopingOrganization>
                          </asOtherIDs>
                        </patientPerson>
                        <providerOrganization determinerCode="INSTANCE" classCode="ORG">
                          <id root="2.16.840.1.113883.3.933"/>
                          <name>Good Health Clinic</name>
                          <contactParty classCode="CON">
                            <telecom value="3425558394"/>
                          </contactParty>
                        </providerOrganization>
                      </patient>
                    </subject1>
                    <custodian typeCode="CST">
                      <assignedEntity classCode="ASSIGNED">
                        <id root="2.16.840.1.113883.3.933"/>
                        <assignedOrganization determinerCode="INSTANCE" classCode="ORG">
                          <name>Good Health Clinic</name>
                        </assignedOrganization>
                      </assignedEntity>
                    </custodian>
                  </registrationEvent>
                </subject>
              </controlActProcess>
            </idm:PRPA_IN201302UV02>
          </soap:Body>
        </soap:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - PRPA_IN201301UV02
      Date:
      - Thu, 12 May 2022 18:17:30 GMT
      Content-Length:
      - '3732'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Accept-Ranges:
      - bytes
      Cache-Control:
      - max-age=604800
      Content-Type:
      - text/html; charset=UTF-8
      Date:
      - Thu, 12 May 2022 18:17:30 GMT
      Etag:
      - '"3147526947+gzip"'
      Expires:
      - Thu, 19 May 2022 18:17:30 GMT
      Last-Modified:
      - Thu, 17 Oct 2019 07:18:26 GMT
      Server:
      - EOS (vny/044F)
      Vary:
      - Accept-Encoding
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
          xmlns:xsd="http://www.w3.org/2001/XMLSchema"
          xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          <env:Header/>
          <env:Body>
            <idm:MCCI_IN000002UV01 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/MCCI_IN000002UV01.xsd"
              xmlns="urn:hl7-org:v3"
              xmlns:idm="http://**********">
              <id extension="WSDOC2002061957449380569866168" root="2.16.840.1.113883.4.349"/>
              <creationTime value="20200206195744"/>
              <versionCode code="4.1"/>
              <interactionId extension="MCCI_IN000002UV01" root="2.16.840.1.113883.1.6"/>
              <processingCode code="T"/>
              <processingModeCode code="T"/>
              <acceptAckCode code="NE"/>
              <receiver typeCode="RCV">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
                </device>
              </receiver>
              <sender typeCode="SND">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200M" root="2.16.840.1.113883.4.349"/>
                </device>
              </sender>
              <acknowledgement>
                <typeCode code="AE"/>
                <targetMessage>
                  <id extension="200VGOV-1373004c-e23e-4d94-90c5-5b101f6be54a" root="22a0f9e0-4454-11dc-a6be-3603d6866807"/>
                </targetMessage>
                <acknowledgementDetail>
                  <code codeSystem="2.16.840.1.113883.5.1100" code="INTERR" displayName="Internal System Error"/>
                  <text>Internal System Error</text>
                </acknowledgementDetail>
                <acknowledgementDetail>
                  <text>Internal System Error</text>
                </acknowledgementDetail>
              </acknowledgement>
            </idm:MCCI_IN000002UV01>
          </env:Body>
        </env:Envelope>
  recorded_at: Thu, 12 May 2022 18:17:30 GMT
recorded_with: VCR 6.1.0
